In [ ]:
# (base) C:\Windows\system32>activate ai
# (ai) C:\Windows\system32>conda install cx_oracle

In [ ]:
# (ai) C:\Windows\system32>conda install sqlalchemy

In [1]:
!conda list sqlalchemy

# packages in environment at C:\ProgramData\anaconda3\envs\ai:
#
# Name                    Version                   Build  Channel
sqlalchemy                2.0.37          py312h54f65d0_0

In [2]:
!conda list cx_oracle

# packages in environment at C:\ProgramData\anaconda3\envs\ai:
#
# Name                    Version                   Build  Channel
cx_oracle                 8.3.0           py312h2bbff1b_0

In [3]:
!pip show sqlalchemy

Name: SQLAlchemy
Version: 2.0.37
Summary: Database Abstraction Library
Home-page: https://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: C:\ProgramData\anaconda3\envs\ai\Lib\site-packages
Requires: greenlet, typing-extensions
Required-by:

In [4]:
import cx_Oracle  # Oracle
# import pymysql  # MariaDB, MySQL

# import mysql.connector
from sqlalchemy import create_engine  # Pandas -> Oracle
import numpy as np

In [13]:
# Oracle Connection 연결, ai 계정으로 XE 사용.
# conn = cx_Oracle.connect('ai/1234@3.146.175.211:1521/XE')
# conn = cx_Oracle.connect('hr/1234@127.0.0.1:1521/XE')
conn = cx_Oracle.connect('hr/1234@192.168.0.101:1521/XE')

cursor = conn.cursor()

In [14]:
# 테이블 삭제
cursor.execute('DROP TABLE crawling')

DatabaseError: ORA-00942: table or view does not exist

In [15]:
cursor.execute('''
CREATE TABLE crawling(
  no    NUMBER(7)   NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE        NOT NULL
)
''')

# cursor.close()
# conn.close()

In [16]:
# Sequence delete
cursor.execute('DROP SEQUENCE crawling_seq')

DatabaseError: ORA-02289: sequence does not exist

In [17]:
# Sequence 생성 
cursor.execute('''
CREATE SEQUENCE crawling_seq
  START WITH 1           
  INCREMENT BY 1         
  MAXVALUE 9999999 
  CACHE 2             
  NOCYCLE            
''')

In [18]:
sql = '''
INSERT INTO crawling (no, name, phone, email, rdate) 
VALUES (crawling_seq.nextval, :name, :phone, :email, sysdate)
''' 

result = cursor.execute(sql, ('홍길순', '021-322-1542', 'mail1@mail.com'))
print('result:', result) # None: 정상 처리, Exception: 에러

cursor.execute(sql, ('나길순', '021-322-1542', 'mail2@mail.com'))
cursor.execute(sql, ('다길순', '021-322-1542', 'mail3@mail.com'))
 
conn.commit()

result: None

In [20]:
# 목록
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
# print(type(rows))
# print(np.array(rows).shape)
# print(rows)
# print(type(rows[0]))  # <class 'tuple'>
for row in rows:
    fmt = "{0}, {1}, {2}, {3}, {4} "
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

1, 홍길순, 021-322-1542, mail1@mail.com, 2025-04-27 17:59:16
2, 나길순, 021-322-1542, mail2@mail.com, 2025-04-27 17:59:16
3, 다길순, 021-322-1542, mail3@mail.com, 2025-04-27 17:59:16

In [21]:
# 한건의 레코드 조회
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no
  '''
cursor.execute(sql, (1,)) # (1,): Tuple로 인식

row = cursor.fetchone() # 하나의 레코드 산출
if row is not None:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('No more rows found.')

1, 홍길순, 021-322-1542, mail1@mail.com, 2025-04-27 17:59:16

In [16]:
# 한건의 레코드 조회, 조건의 추가
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no and name=:name
'''
cursor.execute(sql, (1, '홍길순'))

row = cursor.fetchone() # 하나의 레코드 산출
# print(type(row)) # <class 'tuple'>
if row != None:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))
else:
    print('일치하는 레코드가 없습니다.')

1, 홍길순, 021-322-1542, mail1@mail.com, 2025-04-27 09:27:35

In [23]:
# 수정
sql='''
  UPDATE crawling 
  SET name=:name, phone=:phone, email=:email, rdate=sysdate
  WHERE no=:no
'''
cursor.execute(sql, ('아로미', '010-123-1234', 'mail10@mail.com', 2))

conn.commit()

sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  WHERE no=:no
'''
cursor.execute(sql, (2,))

row = cursor.fetchone() # 하나의 레코드 산출
fmt = "{0}, {1}, {2}, {3}, {4}"
print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

2, 아로미, 010-123-1234, mail10@mail.com, 2025-04-27 18:03:44

In [24]:
# 삭제
sql='''
  DELETE FROM crawling
  WHERE no=:no
'''
cursor.execute(sql, (1,))
conn.commit()

cursor = conn.cursor()
sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    fmt = "{0}, {1}, {2}, {3}, {4}"
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

cursor.close()
conn.close()

2, 아로미, 010-123-1234, mail10@mail.com, 2025-04-27 18:03:44
3, 다길순, 021-322-1542, mail3@mail.com, 2025-04-27 17:59:16

In [25]:
import pandas as pd

# Oracle -> Pandas
# conn = cx_Oracle.connect('ai/1234@3.146.175.211:1521/XE')
conn = cx_Oracle.connect('hr/1234@192.168.0.101:1521/XE')

sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
df = pd.read_sql(sql, conn) # ★

conn.close()

df

C:\Users\sdedu\AppData\Local\Temp\ipykernel_5844\772608189.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn) # ★

   NO NAME         PHONE            EMAIL               RDATE
0   2  아로미  010-123-1234  mail10@mail.com 2025-04-27 18:03:44
1   3  다길순  021-322-1542   mail3@mail.com 2025-04-27 17:59:16

In [26]:
# DataFrame은 컬럼명을 대문자로 저장함으로 대소문자 주의
max_val = max(df['NO'])+1  
max_val

4

In [28]:
# DataFrame에 1명의 주소를 추가할것, 컬럼명 대소문자 구분.
new_row = {'NO':max_val, 'NAME':'칼로미', 'PHONE': '000-1111-1111', 'EMAIL': 'mail7', 'RDATE':'2020-06-25 17:00:00'}
df2 = pd.concat([df, pd.DataFrame([new_row])], ignore_index=True)

In [29]:
df2

   NO NAME          PHONE            EMAIL                RDATE
0   2  아로미   010-123-1234  mail10@mail.com  2025-04-27 18:03:44
1   3  다길순   021-322-1542   mail3@mail.com  2025-04-27 17:59:16
2   4  칼로미  000-1111-1111            mail7  2020-06-25 17:00:00

In [30]:
# Oracle 테이블 다시 생성
# conn = cx_Oracle.connect('ai/1234@3.146.175.211:1521/XE')
conn = cx_Oracle.connect('hr/1234@192.168.0.101:1521/XE')
cursor = conn.cursor()

cursor.execute('DROP TABLE crawling')
cursor.execute('''
CREATE TABLE crawling (
  no    NUMBER(7)   NOT NULL PRIMARY KEY,
  name  VARCHAR(32) NOT NULL, 
  phone VARCHAR(32) NOT NULL, 
  email VARCHAR(64) NOT NULL,
  rdate DATE        NOT NULL
)
''')

# Sequence 충돌 문제로 사용안함
cursor.execute('DROP SEQUENCE crawling_seq') 

cursor.close()
conn.close()

In [38]:
# Oracle Date 지원 형식으로 변경, 컬럼명 대소문자 구분
df2['RDATE'] = pd.to_datetime(df2['RDATE']) 
df2

   NO NAME          PHONE            EMAIL               RDATE
0   2  아로미   010-123-1234  mail10@mail.com 2025-04-27 18:03:44
1   3  다길순   021-322-1542   mail3@mail.com 2025-04-27 17:59:16
2   4  칼로미  000-1111-1111            mail7 2020-06-25 17:00:00

In [39]:
!pip show pandas # Version: 1.3.0

Name: pandas
Version: 2.2.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

 Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
 All rights reserved.

 Copyright (c) 2011-2023, Open source contributors.

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions are met:

 * Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

 * Redistributions in binary form must reproduce the above copyright notice,
   this list of conditions and the following disclaimer in the documentation
   and/or other materials provided with the distribution.

 * Neither the name of the copyright holder nor the names of its
   contributors may be used to endorse or promote products derived from
   this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

Location: C:\ProgramData\anaconda3\envs\ai\Lib\site-packages
Requires: numpy, python-dateutil, pytz, tzdata
Required-by: seaborn

WARNING: Package(s) not found: #, 1.3.0, Version:

In [41]:
# sqlalchemy package: Pandas -> Oracle
# engine = create_engine('oracle+cx_oracle://ai:1234@3.146.175.211:1521/?service_name=XE', echo=False)
engine = create_engine('oracle+cx_oracle://hr:1234@192.168.0.101:1521/?service_name=XE', echo=False)

df2.to_sql(name='crawling', con=engine, if_exists='append', index=False)

3

In [43]:
# 등록 확인
# conn = cx_Oracle.connect('ai/1234@127.0.0.1:1521/XE')
conn = cx_Oracle.connect('hr/1234@192.168.0.101:1521/XE')

cursor = conn.cursor()

sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
cursor.execute(sql)
 
rows = cursor.fetchall() # 모든 레코드의 산출
for row in rows:
    fmt = "{0}, {1}, {2}, {3}, {4} "
    print (fmt.format(row[0], row[1], row[2], row[3], row[4]))

2, 아로미, 010-123-1234, mail10@mail.com, 2025-04-27 18:03:44
3, 다길순, 021-322-1542, mail3@mail.com, 2025-04-27 17:59:16
4, 칼로미, 000-1111-1111, mail7, 2020-06-25 17:00:00

In [44]:
# Oracle -> Pandas
# conn = cx_Oracle.connect('ai/1234@127.0.0.1:1521/XE')
conn = cx_Oracle.connect('hr/1234@192.168.0.101:1521/XE')

sql = '''
  SELECT no, name, phone, email, rdate
  FROM crawling
  ORDER BY no ASC
'''
df = pd.read_sql(sql, conn)

conn.close()

df

C:\Users\sdedu\AppData\Local\Temp\ipykernel_5844\2906815652.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   NO NAME          PHONE            EMAIL               RDATE
0   2  아로미   010-123-1234  mail10@mail.com 2025-04-27 18:03:44
1   3  다길순   021-322-1542   mail3@mail.com 2025-04-27 17:59:16
2   4  칼로미  000-1111-1111            mail7 2020-06-25 17:00:00